Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения, которые встречаются в нём более одного раза.
Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.


a = [int(i) for i in input().split()]
b = []
c = []
for i in a:
    if i not in b:  
        b.append(i)   #На этом этапе добавляем только уникальные элементы
    else:
        c.append(i)   # Здесь только оставшиеся дубли
        c.sort()
        c = list(set(c))  #Костыль, который срезает все дубли(это если на входе "111122223333"). Без него, срежется только по одному дублю, на предыдущем шаге добавления.               
print(*c) #Это тёмная магия 
